###################################################################

# Created by write_sdc on Sat Dec  3 19:58:00 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.05 [get_ports proc_done]
set_load -pin_load 0.05 [get_ports {raddr[10]}]
set_load -pin_load 0.05 [get_ports {raddr[9]}]
set_load -pin_load 0.05 [get_ports {raddr[8]}]
set_load -pin_load 0.05 [get_ports {raddr[7]}]
set_load -pin_load 0.05 [get_ports {raddr[6]}]
set_load -pin_load 0.05 [get_ports {raddr[5]}]
set_load -pin_load 0.05 [get_ports {raddr[4]}]
set_load -pin_load 0.05 [get_ports {raddr[3]}]
set_load -pin_load 0.05 [get_ports {raddr[2]}]
set_load -pin_load 0.05 [get_ports {raddr[1]}]
set_load -pin_load 0.05 [get_ports {raddr[0]}]
set_load -pin_load 0.05 [get_ports {waddr[5]}]
set_load -pin_load 0.05 [get_ports {waddr[4]}]
set_load -pin_load 0.05 [get_ports {waddr[3]}]
set_load -pin_load 0.05 [get_ports {waddr[2]}]
set_load -pin_load 0.05 [get_ports {waddr[1]}]
set_load -pin_load 0.05 [get_ports {waddr[0]}]
set_load -pin_load 0.05 [get_ports {wdata[139]}]
set_load -pin_load 0.05 [get_ports {wdata[138]}]
set_load -pin_load 0.05 [get_ports {wdata[137]}]
set_load -pin_load 0.05 [get_ports {wdata[136]}]
set_load -pin_load 0.05 [get_ports {wdata[135]}]
set_load -pin_load 0.05 [get_ports {wdata[134]}]
set_load -pin_load 0.05 [get_ports {wdata[133]}]
set_load -pin_load 0.05 [get_ports {wdata[132]}]
set_load -pin_load 0.05 [get_ports {wdata[131]}]
set_load -pin_load 0.05 [get_ports {wdata[130]}]
set_load -pin_load 0.05 [get_ports {wdata[129]}]
set_load -pin_load 0.05 [get_ports {wdata[128]}]
set_load -pin_load 0.05 [get_ports {wdata[127]}]
set_load -pin_load 0.05 [get_ports {wdata[126]}]
set_load -pin_load 0.05 [get_ports {wdata[125]}]
set_load -pin_load 0.05 [get_ports {wdata[124]}]
set_load -pin_load 0.05 [get_ports {wdata[123]}]
set_load -pin_load 0.05 [get_ports {wdata[122]}]
set_load -pin_load 0.05 [get_ports {wdata[121]}]
set_load -pin_load 0.05 [get_ports {wdata[120]}]
set_load -pin_load 0.05 [get_ports {wdata[119]}]
set_load -pin_load 0.05 [get_ports {wdata[118]}]
set_load -pin_load 0.05 [get_ports {wdata[117]}]
set_load -pin_load 0.05 [get_ports {wdata[116]}]
set_load -pin_load 0.05 [get_ports {wdata[115]}]
set_load -pin_load 0.05 [get_ports {wdata[114]}]
set_load -pin_load 0.05 [get_ports {wdata[113]}]
set_load -pin_load 0.05 [get_ports {wdata[112]}]
set_load -pin_load 0.05 [get_ports {wdata[111]}]
set_load -pin_load 0.05 [get_ports {wdata[110]}]
set_load -pin_load 0.05 [get_ports {wdata[109]}]
set_load -pin_load 0.05 [get_ports {wdata[108]}]
set_load -pin_load 0.05 [get_ports {wdata[107]}]
set_load -pin_load 0.05 [get_ports {wdata[106]}]
set_load -pin_load 0.05 [get_ports {wdata[105]}]
set_load -pin_load 0.05 [get_ports {wdata[104]}]
set_load -pin_load 0.05 [get_ports {wdata[103]}]
set_load -pin_load 0.05 [get_ports {wdata[102]}]
set_load -pin_load 0.05 [get_ports {wdata[101]}]
set_load -pin_load 0.05 [get_ports {wdata[100]}]
set_load -pin_load 0.05 [get_ports {wdata[99]}]
set_load -pin_load 0.05 [get_ports {wdata[98]}]
set_load -pin_load 0.05 [get_ports {wdata[97]}]
set_load -pin_load 0.05 [get_ports {wdata[96]}]
set_load -pin_load 0.05 [get_ports {wdata[95]}]
set_load -pin_load 0.05 [get_ports {wdata[94]}]
set_load -pin_load 0.05 [get_ports {wdata[93]}]
set_load -pin_load 0.05 [get_ports {wdata[92]}]
set_load -pin_load 0.05 [get_ports {wdata[91]}]
set_load -pin_load 0.05 [get_ports {wdata[90]}]
set_load -pin_load 0.05 [get_ports {wdata[89]}]
set_load -pin_load 0.05 [get_ports {wdata[88]}]
set_load -pin_load 0.05 [get_ports {wdata[87]}]
set_load -pin_load 0.05 [get_ports {wdata[86]}]
set_load -pin_load 0.05 [get_ports {wdata[85]}]
set_load -pin_load 0.05 [get_ports {wdata[84]}]
set_load -pin_load 0.05 [get_ports {wdata[83]}]
set_load -pin_load 0.05 [get_ports {wdata[82]}]
set_load -pin_load 0.05 [get_ports {wdata[81]}]
set_load -pin_load 0.05 [get_ports {wdata[80]}]
set_load -pin_load 0.05 [get_ports {wdata[79]}]
set_load -pin_load 0.05 [get_ports {wdata[78]}]
set_load -pin_load 0.05 [get_ports {wdata[77]}]
set_load -pin_load 0.05 [get_ports {wdata[76]}]
set_load -pin_load 0.05 [get_ports {wdata[75]}]
set_load -pin_load 0.05 [get_ports {wdata[74]}]
set_load -pin_load 0.05 [get_ports {wdata[73]}]
set_load -pin_load 0.05 [get_ports {wdata[72]}]
set_load -pin_load 0.05 [get_ports {wdata[71]}]
set_load -pin_load 0.05 [get_ports {wdata[70]}]
set_load -pin_load 0.05 [get_ports {wdata[69]}]
set_load -pin_load 0.05 [get_ports {wdata[68]}]
set_load -pin_load 0.05 [get_ports {wdata[67]}]
set_load -pin_load 0.05 [get_ports {wdata[66]}]
set_load -pin_load 0.05 [get_ports {wdata[65]}]
set_load -pin_load 0.05 [get_ports {wdata[64]}]
set_load -pin_load 0.05 [get_ports {wdata[63]}]
set_load -pin_load 0.05 [get_ports {wdata[62]}]
set_load -pin_load 0.05 [get_ports {wdata[61]}]
set_load -pin_load 0.05 [get_ports {wdata[60]}]
set_load -pin_load 0.05 [get_ports {wdata[59]}]
set_load -pin_load 0.05 [get_ports {wdata[58]}]
set_load -pin_load 0.05 [get_ports {wdata[57]}]
set_load -pin_load 0.05 [get_ports {wdata[56]}]
set_load -pin_load 0.05 [get_ports {wdata[55]}]
set_load -pin_load 0.05 [get_ports {wdata[54]}]
set_load -pin_load 0.05 [get_ports {wdata[53]}]
set_load -pin_load 0.05 [get_ports {wdata[52]}]
set_load -pin_load 0.05 [get_ports {wdata[51]}]
set_load -pin_load 0.05 [get_ports {wdata[50]}]
set_load -pin_load 0.05 [get_ports {wdata[49]}]
set_load -pin_load 0.05 [get_ports {wdata[48]}]
set_load -pin_load 0.05 [get_ports {wdata[47]}]
set_load -pin_load 0.05 [get_ports {wdata[46]}]
set_load -pin_load 0.05 [get_ports {wdata[45]}]
set_load -pin_load 0.05 [get_ports {wdata[44]}]
set_load -pin_load 0.05 [get_ports {wdata[43]}]
set_load -pin_load 0.05 [get_ports {wdata[42]}]
set_load -pin_load 0.05 [get_ports {wdata[41]}]
set_load -pin_load 0.05 [get_ports {wdata[40]}]
set_load -pin_load 0.05 [get_ports {wdata[39]}]
set_load -pin_load 0.05 [get_ports {wdata[38]}]
set_load -pin_load 0.05 [get_ports {wdata[37]}]
set_load -pin_load 0.05 [get_ports {wdata[36]}]
set_load -pin_load 0.05 [get_ports {wdata[35]}]
set_load -pin_load 0.05 [get_ports {wdata[34]}]
set_load -pin_load 0.05 [get_ports {wdata[33]}]
set_load -pin_load 0.05 [get_ports {wdata[32]}]
set_load -pin_load 0.05 [get_ports {wdata[31]}]
set_load -pin_load 0.05 [get_ports {wdata[30]}]
set_load -pin_load 0.05 [get_ports {wdata[29]}]
set_load -pin_load 0.05 [get_ports {wdata[28]}]
set_load -pin_load 0.05 [get_ports {wdata[27]}]
set_load -pin_load 0.05 [get_ports {wdata[26]}]
set_load -pin_load 0.05 [get_ports {wdata[25]}]
set_load -pin_load 0.05 [get_ports {wdata[24]}]
set_load -pin_load 0.05 [get_ports {wdata[23]}]
set_load -pin_load 0.05 [get_ports {wdata[22]}]
set_load -pin_load 0.05 [get_ports {wdata[21]}]
set_load -pin_load 0.05 [get_ports {wdata[20]}]
set_load -pin_load 0.05 [get_ports {wdata[19]}]
set_load -pin_load 0.05 [get_ports {wdata[18]}]
set_load -pin_load 0.05 [get_ports {wdata[17]}]
set_load -pin_load 0.05 [get_ports {wdata[16]}]
set_load -pin_load 0.05 [get_ports {wdata[15]}]
set_load -pin_load 0.05 [get_ports {wdata[14]}]
set_load -pin_load 0.05 [get_ports {wdata[13]}]
set_load -pin_load 0.05 [get_ports {wdata[12]}]
set_load -pin_load 0.05 [get_ports {wdata[11]}]
set_load -pin_load 0.05 [get_ports {wdata[10]}]
set_load -pin_load 0.05 [get_ports {wdata[9]}]
set_load -pin_load 0.05 [get_ports {wdata[8]}]
set_load -pin_load 0.05 [get_ports {wdata[7]}]
set_load -pin_load 0.05 [get_ports {wdata[6]}]
set_load -pin_load 0.05 [get_ports {wdata[5]}]
set_load -pin_load 0.05 [get_ports {wdata[4]}]
set_load -pin_load 0.05 [get_ports {wdata[3]}]
set_load -pin_load 0.05 [get_ports {wdata[2]}]
set_load -pin_load 0.05 [get_ports {wdata[1]}]
set_load -pin_load 0.05 [get_ports {wdata[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports rst_n]
set_input_delay -clock clk  1  [get_ports module_en]
set_input_delay -clock clk  1  [get_ports {rdata[191]}]
set_input_delay -clock clk  1  [get_ports {rdata[190]}]
set_input_delay -clock clk  1  [get_ports {rdata[189]}]
set_input_delay -clock clk  1  [get_ports {rdata[188]}]
set_input_delay -clock clk  1  [get_ports {rdata[187]}]
set_input_delay -clock clk  1  [get_ports {rdata[186]}]
set_input_delay -clock clk  1  [get_ports {rdata[185]}]
set_input_delay -clock clk  1  [get_ports {rdata[184]}]
set_input_delay -clock clk  1  [get_ports {rdata[183]}]
set_input_delay -clock clk  1  [get_ports {rdata[182]}]
set_input_delay -clock clk  1  [get_ports {rdata[181]}]
set_input_delay -clock clk  1  [get_ports {rdata[180]}]
set_input_delay -clock clk  1  [get_ports {rdata[179]}]
set_input_delay -clock clk  1  [get_ports {rdata[178]}]
set_input_delay -clock clk  1  [get_ports {rdata[177]}]
set_input_delay -clock clk  1  [get_ports {rdata[176]}]
set_input_delay -clock clk  1  [get_ports {rdata[175]}]
set_input_delay -clock clk  1  [get_ports {rdata[174]}]
set_input_delay -clock clk  1  [get_ports {rdata[173]}]
set_input_delay -clock clk  1  [get_ports {rdata[172]}]
set_input_delay -clock clk  1  [get_ports {rdata[171]}]
set_input_delay -clock clk  1  [get_ports {rdata[170]}]
set_input_delay -clock clk  1  [get_ports {rdata[169]}]
set_input_delay -clock clk  1  [get_ports {rdata[168]}]
set_input_delay -clock clk  1  [get_ports {rdata[167]}]
set_input_delay -clock clk  1  [get_ports {rdata[166]}]
set_input_delay -clock clk  1  [get_ports {rdata[165]}]
set_input_delay -clock clk  1  [get_ports {rdata[164]}]
set_input_delay -clock clk  1  [get_ports {rdata[163]}]
set_input_delay -clock clk  1  [get_ports {rdata[162]}]
set_input_delay -clock clk  1  [get_ports {rdata[161]}]
set_input_delay -clock clk  1  [get_ports {rdata[160]}]
set_input_delay -clock clk  1  [get_ports {rdata[159]}]
set_input_delay -clock clk  1  [get_ports {rdata[158]}]
set_input_delay -clock clk  1  [get_ports {rdata[157]}]
set_input_delay -clock clk  1  [get_ports {rdata[156]}]
set_input_delay -clock clk  1  [get_ports {rdata[155]}]
set_input_delay -clock clk  1  [get_ports {rdata[154]}]
set_input_delay -clock clk  1  [get_ports {rdata[153]}]
set_input_delay -clock clk  1  [get_ports {rdata[152]}]
set_input_delay -clock clk  1  [get_ports {rdata[151]}]
set_input_delay -clock clk  1  [get_ports {rdata[150]}]
set_input_delay -clock clk  1  [get_ports {rdata[149]}]
set_input_delay -clock clk  1  [get_ports {rdata[148]}]
set_input_delay -clock clk  1  [get_ports {rdata[147]}]
set_input_delay -clock clk  1  [get_ports {rdata[146]}]
set_input_delay -clock clk  1  [get_ports {rdata[145]}]
set_input_delay -clock clk  1  [get_ports {rdata[144]}]
set_input_delay -clock clk  1  [get_ports {rdata[143]}]
set_input_delay -clock clk  1  [get_ports {rdata[142]}]
set_input_delay -clock clk  1  [get_ports {rdata[141]}]
set_input_delay -clock clk  1  [get_ports {rdata[140]}]
set_input_delay -clock clk  1  [get_ports {rdata[139]}]
set_input_delay -clock clk  1  [get_ports {rdata[138]}]
set_input_delay -clock clk  1  [get_ports {rdata[137]}]
set_input_delay -clock clk  1  [get_ports {rdata[136]}]
set_input_delay -clock clk  1  [get_ports {rdata[135]}]
set_input_delay -clock clk  1  [get_ports {rdata[134]}]
set_input_delay -clock clk  1  [get_ports {rdata[133]}]
set_input_delay -clock clk  1  [get_ports {rdata[132]}]
set_input_delay -clock clk  1  [get_ports {rdata[131]}]
set_input_delay -clock clk  1  [get_ports {rdata[130]}]
set_input_delay -clock clk  1  [get_ports {rdata[129]}]
set_input_delay -clock clk  1  [get_ports {rdata[128]}]
set_input_delay -clock clk  1  [get_ports {rdata[127]}]
set_input_delay -clock clk  1  [get_ports {rdata[126]}]
set_input_delay -clock clk  1  [get_ports {rdata[125]}]
set_input_delay -clock clk  1  [get_ports {rdata[124]}]
set_input_delay -clock clk  1  [get_ports {rdata[123]}]
set_input_delay -clock clk  1  [get_ports {rdata[122]}]
set_input_delay -clock clk  1  [get_ports {rdata[121]}]
set_input_delay -clock clk  1  [get_ports {rdata[120]}]
set_input_delay -clock clk  1  [get_ports {rdata[119]}]
set_input_delay -clock clk  1  [get_ports {rdata[118]}]
set_input_delay -clock clk  1  [get_ports {rdata[117]}]
set_input_delay -clock clk  1  [get_ports {rdata[116]}]
set_input_delay -clock clk  1  [get_ports {rdata[115]}]
set_input_delay -clock clk  1  [get_ports {rdata[114]}]
set_input_delay -clock clk  1  [get_ports {rdata[113]}]
set_input_delay -clock clk  1  [get_ports {rdata[112]}]
set_input_delay -clock clk  1  [get_ports {rdata[111]}]
set_input_delay -clock clk  1  [get_ports {rdata[110]}]
set_input_delay -clock clk  1  [get_ports {rdata[109]}]
set_input_delay -clock clk  1  [get_ports {rdata[108]}]
set_input_delay -clock clk  1  [get_ports {rdata[107]}]
set_input_delay -clock clk  1  [get_ports {rdata[106]}]
set_input_delay -clock clk  1  [get_ports {rdata[105]}]
set_input_delay -clock clk  1  [get_ports {rdata[104]}]
set_input_delay -clock clk  1  [get_ports {rdata[103]}]
set_input_delay -clock clk  1  [get_ports {rdata[102]}]
set_input_delay -clock clk  1  [get_ports {rdata[101]}]
set_input_delay -clock clk  1  [get_ports {rdata[100]}]
set_input_delay -clock clk  1  [get_ports {rdata[99]}]
set_input_delay -clock clk  1  [get_ports {rdata[98]}]
set_input_delay -clock clk  1  [get_ports {rdata[97]}]
set_input_delay -clock clk  1  [get_ports {rdata[96]}]
set_input_delay -clock clk  1  [get_ports {rdata[95]}]
set_input_delay -clock clk  1  [get_ports {rdata[94]}]
set_input_delay -clock clk  1  [get_ports {rdata[93]}]
set_input_delay -clock clk  1  [get_ports {rdata[92]}]
set_input_delay -clock clk  1  [get_ports {rdata[91]}]
set_input_delay -clock clk  1  [get_ports {rdata[90]}]
set_input_delay -clock clk  1  [get_ports {rdata[89]}]
set_input_delay -clock clk  1  [get_ports {rdata[88]}]
set_input_delay -clock clk  1  [get_ports {rdata[87]}]
set_input_delay -clock clk  1  [get_ports {rdata[86]}]
set_input_delay -clock clk  1  [get_ports {rdata[85]}]
set_input_delay -clock clk  1  [get_ports {rdata[84]}]
set_input_delay -clock clk  1  [get_ports {rdata[83]}]
set_input_delay -clock clk  1  [get_ports {rdata[82]}]
set_input_delay -clock clk  1  [get_ports {rdata[81]}]
set_input_delay -clock clk  1  [get_ports {rdata[80]}]
set_input_delay -clock clk  1  [get_ports {rdata[79]}]
set_input_delay -clock clk  1  [get_ports {rdata[78]}]
set_input_delay -clock clk  1  [get_ports {rdata[77]}]
set_input_delay -clock clk  1  [get_ports {rdata[76]}]
set_input_delay -clock clk  1  [get_ports {rdata[75]}]
set_input_delay -clock clk  1  [get_ports {rdata[74]}]
set_input_delay -clock clk  1  [get_ports {rdata[73]}]
set_input_delay -clock clk  1  [get_ports {rdata[72]}]
set_input_delay -clock clk  1  [get_ports {rdata[71]}]
set_input_delay -clock clk  1  [get_ports {rdata[70]}]
set_input_delay -clock clk  1  [get_ports {rdata[69]}]
set_input_delay -clock clk  1  [get_ports {rdata[68]}]
set_input_delay -clock clk  1  [get_ports {rdata[67]}]
set_input_delay -clock clk  1  [get_ports {rdata[66]}]
set_input_delay -clock clk  1  [get_ports {rdata[65]}]
set_input_delay -clock clk  1  [get_ports {rdata[64]}]
set_input_delay -clock clk  1  [get_ports {rdata[63]}]
set_input_delay -clock clk  1  [get_ports {rdata[62]}]
set_input_delay -clock clk  1  [get_ports {rdata[61]}]
set_input_delay -clock clk  1  [get_ports {rdata[60]}]
set_input_delay -clock clk  1  [get_ports {rdata[59]}]
set_input_delay -clock clk  1  [get_ports {rdata[58]}]
set_input_delay -clock clk  1  [get_ports {rdata[57]}]
set_input_delay -clock clk  1  [get_ports {rdata[56]}]
set_input_delay -clock clk  1  [get_ports {rdata[55]}]
set_input_delay -clock clk  1  [get_ports {rdata[54]}]
set_input_delay -clock clk  1  [get_ports {rdata[53]}]
set_input_delay -clock clk  1  [get_ports {rdata[52]}]
set_input_delay -clock clk  1  [get_ports {rdata[51]}]
set_input_delay -clock clk  1  [get_ports {rdata[50]}]
set_input_delay -clock clk  1  [get_ports {rdata[49]}]
set_input_delay -clock clk  1  [get_ports {rdata[48]}]
set_input_delay -clock clk  1  [get_ports {rdata[47]}]
set_input_delay -clock clk  1  [get_ports {rdata[46]}]
set_input_delay -clock clk  1  [get_ports {rdata[45]}]
set_input_delay -clock clk  1  [get_ports {rdata[44]}]
set_input_delay -clock clk  1  [get_ports {rdata[43]}]
set_input_delay -clock clk  1  [get_ports {rdata[42]}]
set_input_delay -clock clk  1  [get_ports {rdata[41]}]
set_input_delay -clock clk  1  [get_ports {rdata[40]}]
set_input_delay -clock clk  1  [get_ports {rdata[39]}]
set_input_delay -clock clk  1  [get_ports {rdata[38]}]
set_input_delay -clock clk  1  [get_ports {rdata[37]}]
set_input_delay -clock clk  1  [get_ports {rdata[36]}]
set_input_delay -clock clk  1  [get_ports {rdata[35]}]
set_input_delay -clock clk  1  [get_ports {rdata[34]}]
set_input_delay -clock clk  1  [get_ports {rdata[33]}]
set_input_delay -clock clk  1  [get_ports {rdata[32]}]
set_input_delay -clock clk  1  [get_ports {rdata[31]}]
set_input_delay -clock clk  1  [get_ports {rdata[30]}]
set_input_delay -clock clk  1  [get_ports {rdata[29]}]
set_input_delay -clock clk  1  [get_ports {rdata[28]}]
set_input_delay -clock clk  1  [get_ports {rdata[27]}]
set_input_delay -clock clk  1  [get_ports {rdata[26]}]
set_input_delay -clock clk  1  [get_ports {rdata[25]}]
set_input_delay -clock clk  1  [get_ports {rdata[24]}]
set_input_delay -clock clk  1  [get_ports {rdata[23]}]
set_input_delay -clock clk  1  [get_ports {rdata[22]}]
set_input_delay -clock clk  1  [get_ports {rdata[21]}]
set_input_delay -clock clk  1  [get_ports {rdata[20]}]
set_input_delay -clock clk  1  [get_ports {rdata[19]}]
set_input_delay -clock clk  1  [get_ports {rdata[18]}]
set_input_delay -clock clk  1  [get_ports {rdata[17]}]
set_input_delay -clock clk  1  [get_ports {rdata[16]}]
set_input_delay -clock clk  1  [get_ports {rdata[15]}]
set_input_delay -clock clk  1  [get_ports {rdata[14]}]
set_input_delay -clock clk  1  [get_ports {rdata[13]}]
set_input_delay -clock clk  1  [get_ports {rdata[12]}]
set_input_delay -clock clk  1  [get_ports {rdata[11]}]
set_input_delay -clock clk  1  [get_ports {rdata[10]}]
set_input_delay -clock clk  1  [get_ports {rdata[9]}]
set_input_delay -clock clk  1  [get_ports {rdata[8]}]
set_input_delay -clock clk  1  [get_ports {rdata[7]}]
set_input_delay -clock clk  1  [get_ports {rdata[6]}]
set_input_delay -clock clk  1  [get_ports {rdata[5]}]
set_input_delay -clock clk  1  [get_ports {rdata[4]}]
set_input_delay -clock clk  1  [get_ports {rdata[3]}]
set_input_delay -clock clk  1  [get_ports {rdata[2]}]
set_input_delay -clock clk  1  [get_ports {rdata[1]}]
set_input_delay -clock clk  1  [get_ports {rdata[0]}]
set_output_delay -clock clk  1  [get_ports proc_done]
set_output_delay -clock clk  1  [get_ports {raddr[10]}]
set_output_delay -clock clk  1  [get_ports {raddr[9]}]
set_output_delay -clock clk  1  [get_ports {raddr[8]}]
set_output_delay -clock clk  1  [get_ports {raddr[7]}]
set_output_delay -clock clk  1  [get_ports {raddr[6]}]
set_output_delay -clock clk  1  [get_ports {raddr[5]}]
set_output_delay -clock clk  1  [get_ports {raddr[4]}]
set_output_delay -clock clk  1  [get_ports {raddr[3]}]
set_output_delay -clock clk  1  [get_ports {raddr[2]}]
set_output_delay -clock clk  1  [get_ports {raddr[1]}]
set_output_delay -clock clk  1  [get_ports {raddr[0]}]
set_output_delay -clock clk  1  [get_ports {waddr[5]}]
set_output_delay -clock clk  1  [get_ports {waddr[4]}]
set_output_delay -clock clk  1  [get_ports {waddr[3]}]
set_output_delay -clock clk  1  [get_ports {waddr[2]}]
set_output_delay -clock clk  1  [get_ports {waddr[1]}]
set_output_delay -clock clk  1  [get_ports {waddr[0]}]
set_output_delay -clock clk  1  [get_ports {wdata[139]}]
set_output_delay -clock clk  1  [get_ports {wdata[138]}]
set_output_delay -clock clk  1  [get_ports {wdata[137]}]
set_output_delay -clock clk  1  [get_ports {wdata[136]}]
set_output_delay -clock clk  1  [get_ports {wdata[135]}]
set_output_delay -clock clk  1  [get_ports {wdata[134]}]
set_output_delay -clock clk  1  [get_ports {wdata[133]}]
set_output_delay -clock clk  1  [get_ports {wdata[132]}]
set_output_delay -clock clk  1  [get_ports {wdata[131]}]
set_output_delay -clock clk  1  [get_ports {wdata[130]}]
set_output_delay -clock clk  1  [get_ports {wdata[129]}]
set_output_delay -clock clk  1  [get_ports {wdata[128]}]
set_output_delay -clock clk  1  [get_ports {wdata[127]}]
set_output_delay -clock clk  1  [get_ports {wdata[126]}]
set_output_delay -clock clk  1  [get_ports {wdata[125]}]
set_output_delay -clock clk  1  [get_ports {wdata[124]}]
set_output_delay -clock clk  1  [get_ports {wdata[123]}]
set_output_delay -clock clk  1  [get_ports {wdata[122]}]
set_output_delay -clock clk  1  [get_ports {wdata[121]}]
set_output_delay -clock clk  1  [get_ports {wdata[120]}]
set_output_delay -clock clk  1  [get_ports {wdata[119]}]
set_output_delay -clock clk  1  [get_ports {wdata[118]}]
set_output_delay -clock clk  1  [get_ports {wdata[117]}]
set_output_delay -clock clk  1  [get_ports {wdata[116]}]
set_output_delay -clock clk  1  [get_ports {wdata[115]}]
set_output_delay -clock clk  1  [get_ports {wdata[114]}]
set_output_delay -clock clk  1  [get_ports {wdata[113]}]
set_output_delay -clock clk  1  [get_ports {wdata[112]}]
set_output_delay -clock clk  1  [get_ports {wdata[111]}]
set_output_delay -clock clk  1  [get_ports {wdata[110]}]
set_output_delay -clock clk  1  [get_ports {wdata[109]}]
set_output_delay -clock clk  1  [get_ports {wdata[108]}]
set_output_delay -clock clk  1  [get_ports {wdata[107]}]
set_output_delay -clock clk  1  [get_ports {wdata[106]}]
set_output_delay -clock clk  1  [get_ports {wdata[105]}]
set_output_delay -clock clk  1  [get_ports {wdata[104]}]
set_output_delay -clock clk  1  [get_ports {wdata[103]}]
set_output_delay -clock clk  1  [get_ports {wdata[102]}]
set_output_delay -clock clk  1  [get_ports {wdata[101]}]
set_output_delay -clock clk  1  [get_ports {wdata[100]}]
set_output_delay -clock clk  1  [get_ports {wdata[99]}]
set_output_delay -clock clk  1  [get_ports {wdata[98]}]
set_output_delay -clock clk  1  [get_ports {wdata[97]}]
set_output_delay -clock clk  1  [get_ports {wdata[96]}]
set_output_delay -clock clk  1  [get_ports {wdata[95]}]
set_output_delay -clock clk  1  [get_ports {wdata[94]}]
set_output_delay -clock clk  1  [get_ports {wdata[93]}]
set_output_delay -clock clk  1  [get_ports {wdata[92]}]
set_output_delay -clock clk  1  [get_ports {wdata[91]}]
set_output_delay -clock clk  1  [get_ports {wdata[90]}]
set_output_delay -clock clk  1  [get_ports {wdata[89]}]
set_output_delay -clock clk  1  [get_ports {wdata[88]}]
set_output_delay -clock clk  1  [get_ports {wdata[87]}]
set_output_delay -clock clk  1  [get_ports {wdata[86]}]
set_output_delay -clock clk  1  [get_ports {wdata[85]}]
set_output_delay -clock clk  1  [get_ports {wdata[84]}]
set_output_delay -clock clk  1  [get_ports {wdata[83]}]
set_output_delay -clock clk  1  [get_ports {wdata[82]}]
set_output_delay -clock clk  1  [get_ports {wdata[81]}]
set_output_delay -clock clk  1  [get_ports {wdata[80]}]
set_output_delay -clock clk  1  [get_ports {wdata[79]}]
set_output_delay -clock clk  1  [get_ports {wdata[78]}]
set_output_delay -clock clk  1  [get_ports {wdata[77]}]
set_output_delay -clock clk  1  [get_ports {wdata[76]}]
set_output_delay -clock clk  1  [get_ports {wdata[75]}]
set_output_delay -clock clk  1  [get_ports {wdata[74]}]
set_output_delay -clock clk  1  [get_ports {wdata[73]}]
set_output_delay -clock clk  1  [get_ports {wdata[72]}]
set_output_delay -clock clk  1  [get_ports {wdata[71]}]
set_output_delay -clock clk  1  [get_ports {wdata[70]}]
set_output_delay -clock clk  1  [get_ports {wdata[69]}]
set_output_delay -clock clk  1  [get_ports {wdata[68]}]
set_output_delay -clock clk  1  [get_ports {wdata[67]}]
set_output_delay -clock clk  1  [get_ports {wdata[66]}]
set_output_delay -clock clk  1  [get_ports {wdata[65]}]
set_output_delay -clock clk  1  [get_ports {wdata[64]}]
set_output_delay -clock clk  1  [get_ports {wdata[63]}]
set_output_delay -clock clk  1  [get_ports {wdata[62]}]
set_output_delay -clock clk  1  [get_ports {wdata[61]}]
set_output_delay -clock clk  1  [get_ports {wdata[60]}]
set_output_delay -clock clk  1  [get_ports {wdata[59]}]
set_output_delay -clock clk  1  [get_ports {wdata[58]}]
set_output_delay -clock clk  1  [get_ports {wdata[57]}]
set_output_delay -clock clk  1  [get_ports {wdata[56]}]
set_output_delay -clock clk  1  [get_ports {wdata[55]}]
set_output_delay -clock clk  1  [get_ports {wdata[54]}]
set_output_delay -clock clk  1  [get_ports {wdata[53]}]
set_output_delay -clock clk  1  [get_ports {wdata[52]}]
set_output_delay -clock clk  1  [get_ports {wdata[51]}]
set_output_delay -clock clk  1  [get_ports {wdata[50]}]
set_output_delay -clock clk  1  [get_ports {wdata[49]}]
set_output_delay -clock clk  1  [get_ports {wdata[48]}]
set_output_delay -clock clk  1  [get_ports {wdata[47]}]
set_output_delay -clock clk  1  [get_ports {wdata[46]}]
set_output_delay -clock clk  1  [get_ports {wdata[45]}]
set_output_delay -clock clk  1  [get_ports {wdata[44]}]
set_output_delay -clock clk  1  [get_ports {wdata[43]}]
set_output_delay -clock clk  1  [get_ports {wdata[42]}]
set_output_delay -clock clk  1  [get_ports {wdata[41]}]
set_output_delay -clock clk  1  [get_ports {wdata[40]}]
set_output_delay -clock clk  1  [get_ports {wdata[39]}]
set_output_delay -clock clk  1  [get_ports {wdata[38]}]
set_output_delay -clock clk  1  [get_ports {wdata[37]}]
set_output_delay -clock clk  1  [get_ports {wdata[36]}]
set_output_delay -clock clk  1  [get_ports {wdata[35]}]
set_output_delay -clock clk  1  [get_ports {wdata[34]}]
set_output_delay -clock clk  1  [get_ports {wdata[33]}]
set_output_delay -clock clk  1  [get_ports {wdata[32]}]
set_output_delay -clock clk  1  [get_ports {wdata[31]}]
set_output_delay -clock clk  1  [get_ports {wdata[30]}]
set_output_delay -clock clk  1  [get_ports {wdata[29]}]
set_output_delay -clock clk  1  [get_ports {wdata[28]}]
set_output_delay -clock clk  1  [get_ports {wdata[27]}]
set_output_delay -clock clk  1  [get_ports {wdata[26]}]
set_output_delay -clock clk  1  [get_ports {wdata[25]}]
set_output_delay -clock clk  1  [get_ports {wdata[24]}]
set_output_delay -clock clk  1  [get_ports {wdata[23]}]
set_output_delay -clock clk  1  [get_ports {wdata[22]}]
set_output_delay -clock clk  1  [get_ports {wdata[21]}]
set_output_delay -clock clk  1  [get_ports {wdata[20]}]
set_output_delay -clock clk  1  [get_ports {wdata[19]}]
set_output_delay -clock clk  1  [get_ports {wdata[18]}]
set_output_delay -clock clk  1  [get_ports {wdata[17]}]
set_output_delay -clock clk  1  [get_ports {wdata[16]}]
set_output_delay -clock clk  1  [get_ports {wdata[15]}]
set_output_delay -clock clk  1  [get_ports {wdata[14]}]
set_output_delay -clock clk  1  [get_ports {wdata[13]}]
set_output_delay -clock clk  1  [get_ports {wdata[12]}]
set_output_delay -clock clk  1  [get_ports {wdata[11]}]
set_output_delay -clock clk  1  [get_ports {wdata[10]}]
set_output_delay -clock clk  1  [get_ports {wdata[9]}]
set_output_delay -clock clk  1  [get_ports {wdata[8]}]
set_output_delay -clock clk  1  [get_ports {wdata[7]}]
set_output_delay -clock clk  1  [get_ports {wdata[6]}]
set_output_delay -clock clk  1  [get_ports {wdata[5]}]
set_output_delay -clock clk  1  [get_ports {wdata[4]}]
set_output_delay -clock clk  1  [get_ports {wdata[3]}]
set_output_delay -clock clk  1  [get_ports {wdata[2]}]
set_output_delay -clock clk  1  [get_ports {wdata[1]}]
set_output_delay -clock clk  1  [get_ports {wdata[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst_n]
set_drive 1  [get_ports module_en]
set_drive 1  [get_ports {rdata[191]}]
set_drive 1  [get_ports {rdata[190]}]
set_drive 1  [get_ports {rdata[189]}]
set_drive 1  [get_ports {rdata[188]}]
set_drive 1  [get_ports {rdata[187]}]
set_drive 1  [get_ports {rdata[186]}]
set_drive 1  [get_ports {rdata[185]}]
set_drive 1  [get_ports {rdata[184]}]
set_drive 1  [get_ports {rdata[183]}]
set_drive 1  [get_ports {rdata[182]}]
set_drive 1  [get_ports {rdata[181]}]
set_drive 1  [get_ports {rdata[180]}]
set_drive 1  [get_ports {rdata[179]}]
set_drive 1  [get_ports {rdata[178]}]
set_drive 1  [get_ports {rdata[177]}]
set_drive 1  [get_ports {rdata[176]}]
set_drive 1  [get_ports {rdata[175]}]
set_drive 1  [get_ports {rdata[174]}]
set_drive 1  [get_ports {rdata[173]}]
set_drive 1  [get_ports {rdata[172]}]
set_drive 1  [get_ports {rdata[171]}]
set_drive 1  [get_ports {rdata[170]}]
set_drive 1  [get_ports {rdata[169]}]
set_drive 1  [get_ports {rdata[168]}]
set_drive 1  [get_ports {rdata[167]}]
set_drive 1  [get_ports {rdata[166]}]
set_drive 1  [get_ports {rdata[165]}]
set_drive 1  [get_ports {rdata[164]}]
set_drive 1  [get_ports {rdata[163]}]
set_drive 1  [get_ports {rdata[162]}]
set_drive 1  [get_ports {rdata[161]}]
set_drive 1  [get_ports {rdata[160]}]
set_drive 1  [get_ports {rdata[159]}]
set_drive 1  [get_ports {rdata[158]}]
set_drive 1  [get_ports {rdata[157]}]
set_drive 1  [get_ports {rdata[156]}]
set_drive 1  [get_ports {rdata[155]}]
set_drive 1  [get_ports {rdata[154]}]
set_drive 1  [get_ports {rdata[153]}]
set_drive 1  [get_ports {rdata[152]}]
set_drive 1  [get_ports {rdata[151]}]
set_drive 1  [get_ports {rdata[150]}]
set_drive 1  [get_ports {rdata[149]}]
set_drive 1  [get_ports {rdata[148]}]
set_drive 1  [get_ports {rdata[147]}]
set_drive 1  [get_ports {rdata[146]}]
set_drive 1  [get_ports {rdata[145]}]
set_drive 1  [get_ports {rdata[144]}]
set_drive 1  [get_ports {rdata[143]}]
set_drive 1  [get_ports {rdata[142]}]
set_drive 1  [get_ports {rdata[141]}]
set_drive 1  [get_ports {rdata[140]}]
set_drive 1  [get_ports {rdata[139]}]
set_drive 1  [get_ports {rdata[138]}]
set_drive 1  [get_ports {rdata[137]}]
set_drive 1  [get_ports {rdata[136]}]
set_drive 1  [get_ports {rdata[135]}]
set_drive 1  [get_ports {rdata[134]}]
set_drive 1  [get_ports {rdata[133]}]
set_drive 1  [get_ports {rdata[132]}]
set_drive 1  [get_ports {rdata[131]}]
set_drive 1  [get_ports {rdata[130]}]
set_drive 1  [get_ports {rdata[129]}]
set_drive 1  [get_ports {rdata[128]}]
set_drive 1  [get_ports {rdata[127]}]
set_drive 1  [get_ports {rdata[126]}]
set_drive 1  [get_ports {rdata[125]}]
set_drive 1  [get_ports {rdata[124]}]
set_drive 1  [get_ports {rdata[123]}]
set_drive 1  [get_ports {rdata[122]}]
set_drive 1  [get_ports {rdata[121]}]
set_drive 1  [get_ports {rdata[120]}]
set_drive 1  [get_ports {rdata[119]}]
set_drive 1  [get_ports {rdata[118]}]
set_drive 1  [get_ports {rdata[117]}]
set_drive 1  [get_ports {rdata[116]}]
set_drive 1  [get_ports {rdata[115]}]
set_drive 1  [get_ports {rdata[114]}]
set_drive 1  [get_ports {rdata[113]}]
set_drive 1  [get_ports {rdata[112]}]
set_drive 1  [get_ports {rdata[111]}]
set_drive 1  [get_ports {rdata[110]}]
set_drive 1  [get_ports {rdata[109]}]
set_drive 1  [get_ports {rdata[108]}]
set_drive 1  [get_ports {rdata[107]}]
set_drive 1  [get_ports {rdata[106]}]
set_drive 1  [get_ports {rdata[105]}]
set_drive 1  [get_ports {rdata[104]}]
set_drive 1  [get_ports {rdata[103]}]
set_drive 1  [get_ports {rdata[102]}]
set_drive 1  [get_ports {rdata[101]}]
set_drive 1  [get_ports {rdata[100]}]
set_drive 1  [get_ports {rdata[99]}]
set_drive 1  [get_ports {rdata[98]}]
set_drive 1  [get_ports {rdata[97]}]
set_drive 1  [get_ports {rdata[96]}]
set_drive 1  [get_ports {rdata[95]}]
set_drive 1  [get_ports {rdata[94]}]
set_drive 1  [get_ports {rdata[93]}]
set_drive 1  [get_ports {rdata[92]}]
set_drive 1  [get_ports {rdata[91]}]
set_drive 1  [get_ports {rdata[90]}]
set_drive 1  [get_ports {rdata[89]}]
set_drive 1  [get_ports {rdata[88]}]
set_drive 1  [get_ports {rdata[87]}]
set_drive 1  [get_ports {rdata[86]}]
set_drive 1  [get_ports {rdata[85]}]
set_drive 1  [get_ports {rdata[84]}]
set_drive 1  [get_ports {rdata[83]}]
set_drive 1  [get_ports {rdata[82]}]
set_drive 1  [get_ports {rdata[81]}]
set_drive 1  [get_ports {rdata[80]}]
set_drive 1  [get_ports {rdata[79]}]
set_drive 1  [get_ports {rdata[78]}]
set_drive 1  [get_ports {rdata[77]}]
set_drive 1  [get_ports {rdata[76]}]
set_drive 1  [get_ports {rdata[75]}]
set_drive 1  [get_ports {rdata[74]}]
set_drive 1  [get_ports {rdata[73]}]
set_drive 1  [get_ports {rdata[72]}]
set_drive 1  [get_ports {rdata[71]}]
set_drive 1  [get_ports {rdata[70]}]
set_drive 1  [get_ports {rdata[69]}]
set_drive 1  [get_ports {rdata[68]}]
set_drive 1  [get_ports {rdata[67]}]
set_drive 1  [get_ports {rdata[66]}]
set_drive 1  [get_ports {rdata[65]}]
set_drive 1  [get_ports {rdata[64]}]
set_drive 1  [get_ports {rdata[63]}]
set_drive 1  [get_ports {rdata[62]}]
set_drive 1  [get_ports {rdata[61]}]
set_drive 1  [get_ports {rdata[60]}]
set_drive 1  [get_ports {rdata[59]}]
set_drive 1  [get_ports {rdata[58]}]
set_drive 1  [get_ports {rdata[57]}]
set_drive 1  [get_ports {rdata[56]}]
set_drive 1  [get_ports {rdata[55]}]
set_drive 1  [get_ports {rdata[54]}]
set_drive 1  [get_ports {rdata[53]}]
set_drive 1  [get_ports {rdata[52]}]
set_drive 1  [get_ports {rdata[51]}]
set_drive 1  [get_ports {rdata[50]}]
set_drive 1  [get_ports {rdata[49]}]
set_drive 1  [get_ports {rdata[48]}]
set_drive 1  [get_ports {rdata[47]}]
set_drive 1  [get_ports {rdata[46]}]
set_drive 1  [get_ports {rdata[45]}]
set_drive 1  [get_ports {rdata[44]}]
set_drive 1  [get_ports {rdata[43]}]
set_drive 1  [get_ports {rdata[42]}]
set_drive 1  [get_ports {rdata[41]}]
set_drive 1  [get_ports {rdata[40]}]
set_drive 1  [get_ports {rdata[39]}]
set_drive 1  [get_ports {rdata[38]}]
set_drive 1  [get_ports {rdata[37]}]
set_drive 1  [get_ports {rdata[36]}]
set_drive 1  [get_ports {rdata[35]}]
set_drive 1  [get_ports {rdata[34]}]
set_drive 1  [get_ports {rdata[33]}]
set_drive 1  [get_ports {rdata[32]}]
set_drive 1  [get_ports {rdata[31]}]
set_drive 1  [get_ports {rdata[30]}]
set_drive 1  [get_ports {rdata[29]}]
set_drive 1  [get_ports {rdata[28]}]
set_drive 1  [get_ports {rdata[27]}]
set_drive 1  [get_ports {rdata[26]}]
set_drive 1  [get_ports {rdata[25]}]
set_drive 1  [get_ports {rdata[24]}]
set_drive 1  [get_ports {rdata[23]}]
set_drive 1  [get_ports {rdata[22]}]
set_drive 1  [get_ports {rdata[21]}]
set_drive 1  [get_ports {rdata[20]}]
set_drive 1  [get_ports {rdata[19]}]
set_drive 1  [get_ports {rdata[18]}]
set_drive 1  [get_ports {rdata[17]}]
set_drive 1  [get_ports {rdata[16]}]
set_drive 1  [get_ports {rdata[15]}]
set_drive 1  [get_ports {rdata[14]}]
set_drive 1  [get_ports {rdata[13]}]
set_drive 1  [get_ports {rdata[12]}]
set_drive 1  [get_ports {rdata[11]}]
set_drive 1  [get_ports {rdata[10]}]
set_drive 1  [get_ports {rdata[9]}]
set_drive 1  [get_ports {rdata[8]}]
set_drive 1  [get_ports {rdata[7]}]
set_drive 1  [get_ports {rdata[6]}]
set_drive 1  [get_ports {rdata[5]}]
set_drive 1  [get_ports {rdata[4]}]
set_drive 1  [get_ports {rdata[3]}]
set_drive 1  [get_ports {rdata[2]}]
set_drive 1  [get_ports {rdata[1]}]
set_drive 1  [get_ports {rdata[0]}]
